public enum Epoch {
    /** Дубины, пращи, мамонты, ежи */
    StoneAge,

    /** Гоплиты, лучники, всадники, баллисты */
    Antiquity,

    /** Рыцари, арбалеты, осадные башни, катапульты */
    MiddleAges,

    /** Мушкетеры, пираты, пушки-картечь, мортиры */
    GunpowderAge,

    /** Паровые танки, снайперы, пулемет "Максим", молот */
    IndustrialAge,

    /** Тяжелая сталь, радисты, мотоциклы, зенитки, огнеметы */
    Dieselpunk,

    /** Бронежилеты, дроны, тепловизоры, снайперские турели */
    Modernity,

    /** Экзоскелеты, лазеры, ховерборды, плазма, ЭМИ */
    Cyberpunk,
}